app/views/posts/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 30]]
---
         submitted <%= time_ago_in_words(post.created_at) %> ago by <%= post.user.name %><br/>
         <%= post.comments.count %> Comments