app/controllers/posts_controller.rb

SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", "8"]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", "50"]]
---
  def show
    @topic = Topic.find(params[:topic_id])
    @post = Post.find(params[:id])

SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", "1"]]
---
  def new
    @topic = Topic.find(params[:topic_id])

SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", "50"]]
---
  def edit
    @topic = Topic.find(params[:topic_id])
    @post = Post.find(params[:id])

SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "This is my first post.  "], ["created_at", Thu, 23 Oct 2014 19:47:33 UTC +00:00], ["title", "Welcome"], ["updated_at", Thu, 23 Oct 2014 19:47:33 UTC +00:00]]
---
  def create
    @topic = Topic.find(params[:topic_id])
    @post = current_user.posts.build(post_params)
    @post.topic = @topic
    authorize @post

    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "56"]]
---
  def update
    @topic = Topic.find(params[:topic_id])
    @post = Post.find(params[:id])