app/controllers/topics_controller.rb

SELECT "topics".* FROM "topics"
---
  def index
    @topics = Topic.visible_to(current_user).paginate(page: params[:page], per_page: 10)

SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", "16"]]
SELECT "posts".* FROM "posts" WHERE "posts"."topic_id" = ? ORDER BY created_at DESC  [["topic_id", 8]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 44]]
---
  def show
    @topic = Topic.find(params[:id])
    authorize @topic
    @posts = @topic.posts.includes(:user).includes(:comments).paginate(page: params[:page], per_page: 10)

INSERT INTO "topics" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 30 Oct 2014 04:59:34 UTC +00:00], ["description", "This is a test topic created by admin."], ["name", "A New Topic"], ["updated_at", Thu, 30 Oct 2014 04:59:34 UTC +00:00]]
---
  def create
    @topic = Topic.new(topic_params)
    authorize @topic
    if @topic.save